УТ_для_edt/src/AccumulationRegisters/ЗаказыКлиентов/ЗаказыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыКлиентов</name>
  <resources>
    <name>Заказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаОтмены</name>
    <type>
      <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/смартДополнительныеДанныеОбъектов/смартДополнительныеДанныеОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартДополнительныеДанныеОбъектов</name>
  <comment>//++ #Б3014 смарт: Шляпников 15.05.2025 / Интеграция с WMS. Атлант. Приемка. Разработка</comment>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/ВерсииОбъектов/ВерсииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииОбъектов</name>
  <resources>
    <name>ВерсияОбъекта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТабличныеДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>АвторВерсии</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВерсии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВерсииОбъекта</name>
    <type>
      <types>EnumRef.ТипыВерсийОбъекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПроигнорирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДанныеВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияВладелец</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <comment>Технический реквизит, используется при выгрузке данных в РИБ</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Синхронизируется</name>
    <comment>Технический реквизит, используется при выгрузке данных в РИБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смещение</name>
    <comment>Технический реквизит, используется при выгрузке данных в РИБ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждениеСинхронизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовКлиентов</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОбеспечения</name>
  <enumValues>
    <name>ОтгрузитьОбособленно</name>
  </enumValues>
  <enumValues>
    <name>Отгрузить</name>
  </enumValues>
  <enumValues>
    <name>СоСклада</name>
  </enumValues>
  <enumValues>
    <name>ИзЗаказов</name>
  </enumValues>
  <enumValues>
    <name>Обособленно</name>
  </enumValues>
  <enumValues>
    <name>Требуется</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/CommonModules/смартСерверПривилегированный/Module.bsl
#Область Интерфейс

Процедура ИзменитьОбеспечениеЗаказаКлиента(Выборка,ВариантыОбеспечения,ТЗСтрокПрихода = Неопределено,ОбъектСсылка) Экспорт
    
    // Вставить обработку выборки ВыборкаДокумент
	//++ #1128 смарт: Фролов 07.02.2023 //Фоновые задания Поступление товара и Изменение статуса оплаченных
	//ВариантыОбеспечения=Новый Массив;
    //-- #1128 смарт: Фролов 07.02.2023
	Заказ=Выборка.Документ.ПолучитьОбъект(); 
    Попытка
        Заказ.Заблокировать();
    Исключение			
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + Строка(Заказ) + " не возможно изменить, он заблокирован: " + ОписаниеОшибки());
        Возврат;
	КонецПопытки;
	//++ #1128 смарт: Фролов 07.02.2023 //Фоновые задания Поступление товара и Изменение статуса оплаченных
    //ВариантыОбеспечения.Добавить(ВариантОбеспечения);  //Резервировать на складе, К обеспечению 
	//-- #1128 смарт: Фролов 07.02.2023
	
    ВыбранноеЗначение=Новый Структура("ЗаполнятьЦелымиУпаковками,ПереченьВариантов",Ложь,ВариантыОбеспечения);
    
    ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Неопределено, Истина, Ложь);
    ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыбранноеЗначение);
    ПутиКДанным = Новый Соответствие; //Описание особенностей формы
    ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки"); // дату отгрузки работ необходимо брать из поля "Дата отгрузки".  
    
    ПараметрыДокумента = Новый Структура;
    ПараметрыДокумента.Вставить("СтатусКВыполнению", Заказ.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
    ПараметрыДокумента.Вставить("ГруппаСкладов", Заказ.Склад);
    ПараметрыДокумента.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыКлиентов);
    ПараметрыДокумента.Вставить("ПутиКДанным", ПутиКДанным);
    ПараметрыДокумента.Вставить("ИмяТабличнойЧасти","Товары");
    
    ВыборкаДетальныеЗаписи = Выборка.Выбрать();
    МассивСтрок=Новый Массив;
    ДокументИзменен = Ложь;
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
        Если ТЗСтрокПрихода = Неопределено Тогда
			//++ #5004 смарт: Тимофеева 24.11.2025 / Проверить алгоритм автоматической установки резервов по приходу товаров. 
			//СтрокаЗаказа = Заказ.Товары.Получить(ВыборкаДетальныеЗаписи.НомерСтроки-1);
			////++ #1128 смарт: Фролов 07.02.2023 //Фоновые задания Поступление товара и Изменение статуса оплаченных
			//Если ЗначениеЗаполнено(СтрокаЗаказа) И СтрокаЗаказа.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура И СтрокаЗаказа.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.СоСклада Тогда
			////Если ЗначениеЗаполнено(СтрокаЗаказа) И СтрокаЗаказа.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура И СтрокаЗаказа.ВариантОбеспечения <> ВариантОбеспечения Тогда	
			////-- #1128 смарт: Фролов 07.02.2023
			//    МассивСтрок.Добавить(ВыборкаДетальныеЗаписи.НомерСтроки-1);
			//    ДокументИзменен = Истина;
			//КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.смартНомерСтрокиЗаказа > 0 Тогда 			
				СтрокаЗаказа = Заказ.Товары.Получить(ВыборкаДетальныеЗаписи.смартНомерСтрокиЗаказа-1);
				Если ЗначениеЗаполнено(СтрокаЗаказа) И СтрокаЗаказа.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура И СтрокаЗаказа.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.СоСклада Тогда
					МассивСтрок.Добавить(ВыборкаДетальныеЗаписи.смартНомерСтрокиЗаказа-1);
					ДокументИзменен = Истина;
				КонецЕсли;  
			Иначе
				СтрокаЗаказа = Заказ.Товары.Получить(ВыборкаДетальныеЗаписи.НомерСтроки-1);
				Если ЗначениеЗаполнено(СтрокаЗаказа) И СтрокаЗаказа.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура И СтрокаЗаказа.ВариантОбеспечения <> Перечисления.ВариантыОбеспечения.СоСклада Тогда
					МассивСтрок.Добавить(ВыборкаДетальныеЗаписи.НомерСтроки-1);
				    ДокументИзменен = Истина;
				КонецЕсли;
			КонецЕсли;
			//-- #5004 смарт: Тимофеева 24.11.2025
        Иначе
            МассивСтрокПрихода = ТЗСтрокПрихода.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",ВыборкаДетальныеЗаписи.Номенклатура,ВыборкаДетальныеЗаписи.Характеристика));
            Если МассивСтрокПрихода[0].Количество >= ВыборкаДетальныеЗаписи.КоличествоОтгрузка Тогда
                //++ #5004 смарт: Тимофеева 24.11.2025 / Проверить алгоритм автоматической установки резервов по приходу товаров.
				//МассивСтрок.Добавить(ВыборкаДетальныеЗаписи.НомерСтроки-1);
				Если ВыборкаДетальныеЗаписи.смартНомерСтрокиЗаказа > 0 Тогда
					МассивСтрок.Добавить(ВыборкаДетальныеЗаписи.смартНомерСтрокиЗаказа-1); 
				Иначе
					МассивСтрок.Добавить(ВыборкаДетальныеЗаписи.НомерСтроки-1);
				КонецЕсли;
				//-- #5004 смарт: Тимофеева 24.11.2025
				ДокументИзменен = Истина;
                МассивСтрокПрихода[0].Количество = МассивСтрокПрихода[0].Количество - ВыборкаДетальныеЗаписи.КоличествоОтгрузка; 
            КонецЕсли;
        КонецЕсли;
    КонецЦикла; 
    
    Таблица = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспеченияДокумента(Заказ,ВариантыОбеспечения,ПараметрыДокумента,МассивСтрок);
    
    Текст=Документы.ЗаказКлиента.ЗаполнитьВариантОбеспечения(Заказ,Неопределено,"ИндексыСтрок",Таблица);  
    
    НавСсылка=ПолучитьНавигационнуюСсылку(Заказ);
    Если ДокументИзменен Тогда
        
		Попытка 
			УстановитьПривилегированныйРежим = Истина;
			
            Заказ.Записать(РежимЗаписиДокумента.Проведение);
            Если ТЗСтрокПрихода = Неопределено Тогда  
                ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ: " + Строка(Заказ) + " проведен. Изменены резервы по товарам, с установкой статуса К обеспечению!",Заказ.Ссылка);
            иначе
                ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ: " + Строка(Заказ) + " проведен. Изменены резервы по товарам, с установкой статуса Резервировать на складе!",Заказ.Ссылка);
            КонецЕсли;
            
            НомерПоследнейВерсии = ПолучитьНомерВерсииПоследний(Заказ.Ссылка);
            Если НомерПоследнейВерсии <> Неопределено Тогда
                ВерсионированиеОбъектов.ДобавитьКомментарийКВерсии(Заказ.Ссылка, НомерПоследнейВерсии, "Автоматичесая установка резерва при оприходовании товара на склад");
            КонецЕсли;
            
            ПослВер=ВерсионированиеОбъектов.НомерПоследнейВерсии(Заказ.Ссылка);
            
            СвВер=ВерсионированиеОбъектов.СведенияОВерсииОбъекта(Заказ.Ссылка, ПослВер);  
            
            Копия=Ложь;
            ИнформацияОБазе=Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами.Получить().Получить();
            Если Не ИнформацияОБазе=Неопределено Тогда 
                Копия=ИнформацияОБазе.РаботаСВнешнимиРесурсамиЗаблокирована;
            КонецЕсли;	
            
            Менеджер=Справочники.Пользователи.ПустаяСсылка(); 
            
            Если Не Копия Тогда
                Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Заказ,"Менеджер") И ЗначениеЗаполнено(Заказ.Менеджер) Тогда  
                    Менеджер = Заказ.Менеджер; 
                ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Заказ,"Ответственный") И ЗначениеЗаполнено(Заказ.Ответственный) Тогда
                    Менеджер = Заказ.Ответственный;                
                КонецЕсли;
            КонецЕсли; 
            
            Если ЗначениеЗаполнено(Менеджер) Тогда
                
                УчетнаяЗапись=РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
                ДанныеДляОтправки=Новый Структура;
                ДанныеДляОтправки.Вставить("Кому",Заказ.Менеджер.смартРабочаяПочта); 
                ДанныеДляОтправки.Вставить("Тема","Изменен резерв в: "+Заказ); 
				Если ТЗСтрокПрихода = Неопределено Тогда
					//++ #1561 смарт: Ермаков 22.12.2023 / Добавить доп текст в оповещения
                    ДанныеДляОтправки.Вставить("Тело",
							"Документ изменения: "
							+ ОбъектСсылка
							+ " Автор изменения: "
							+ СвВер.АвторВерсии
							+ Символы.ПС
							+ "К обеспечению: "
							+ Строка(Заказ.Контрагент) + ". "
							+ Строка(Заказ) 
							+ Символы.ПС
							+ " " + Символы.ПС + Символы.ПС
							+ "Навигационная ссылка на документ: " + НавСсылка);
					//-- #1561 смарт: Ермаков 22.12.2023 / Добавить доп текст в оповещения
                иначе
                    ДанныеДляОтправки.Вставить("Тело","Документ изменения: "+ОбъектСсылка+" Автор изменения: "+СвВер.АвторВерсии+Символы.ПС+"   
					//++ #1600 смарт: Ермаков 26.01.2024 / Добавить доп текст в оповещения (продолжение задачи 1561)
					|Резервировать на складе: " + Строка(Заказ.Контрагент) + ". " + Текст + " _ " + Строка(Заказ) + Символы.ПС + " " + Символы.ПС + Символы.ПС + "Навигационная ссылка на документ: " + НавСсылка);
					//-- #1600 смарт: Ермаков 26.01.2024 / Добавить доп текст в оповещения (продолжение задачи 1561)
                КонецЕсли;
                ДанныеДляОтправки.Вставить("ТипТекста",ТипТекстаПочтовогоСообщения.ПростойТекст);
                ДанныеДляОтправки.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Высокая);
                РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись,ДанныеДляОтправки); 
                
                //ЕстьЗаписьОсновной=смартОбработкаПодписокНаСобытия.ПолучитьТекЗаписьНапоминания(Заказ.Менеджер,Заказ);
                //Если НЕ ЕстьЗаписьОсновной Тогда
                //    ПараметрыНапоминания=Новый Структура;
                //    ПараметрыНапоминания.Вставить("Пользователь",Заказ.Менеджер);
                //    ПараметрыНапоминания.Вставить("Источник",Заказ);
                //    ПараметрыНапоминания.Вставить("Описание","Изменен резерв! "+Заказ);
                //    ПараметрыНапоминания.Вставить("ВремяСобытия", ТекущаяДатаСеанса());
                //    ПараметрыНапоминания.Вставить("ИнтервалВремениНапоминания", 300);
                //    ПараметрыНапоминания.Вставить("Идентификатор", "ЗаказКлиента");
                //    НапоминанияПользователяСлужебный.ПодключитьНапоминание(ПараметрыНапоминания);
                //КонецЕсли; 
                //
			КонецЕсли; 
			УстановитьПривилегированныйРежим = Ложь;
            
        Исключение
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ: " + Строка(Заказ) + " не удалось провести. " + ОписаниеОшибки(),Заказ.Ссылка);
            //++ #1128 смарт: Фролов 13.02.2023 //Фоновые задания Поступление товара и Изменение статуса оплаченных  
			ЗаписьЖурналаРегистрации("Документ не удалось провести. ",УровеньЖурналаРегистрации.Ошибка,Заказ,ОписаниеОшибки(),);
            //-- #1128 смарт: Фролов 13.02.2023
			УчетнаяЗапись=РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
            ДанныеДляОтправки=Новый Структура;
            ДанныеДляОтправки.Вставить("Кому","help1c@smart-t.ru"); 
            ДанныеДляОтправки.Вставить("Тема","Не удалось изменить обеспечение, в: "+Заказ);
			Если ЗначениеЗаполнено(Текст) И ТЗСтрокПрихода = Неопределено Тогда
				//++ #1561 смарт: Ермаков 22.12.2023 / Добавить доп текст в оповещения
                ДанныеДляОтправки.Вставить("Тело",
						"Документ изменения: "
						+ ОбъектСсылка + Символы.ПС 
						+ " К обеспечению: "
						+ Текст + " _ " 
						+ Строка(Заказ.Контрагент) + ". " 
						+ Строка(Заказ) 
						+ Символы.ПС                                     
						+ " " + Символы.ПС + Символы.ПС 
						+ "Навигационная ссылка на документ: " + НавСсылка
						+ Символы.ПС
						+ "Ошибка: " + ОписаниеОшибки());				   
                //-- #1561 смарт: Ермаков 22.12.2023 / Добавить доп текст в оповещения
            Иначе
                ДанныеДляОтправки.Вставить("Тело","Документ изменения: "+ОбъектСсылка+Символы.ПС+"   
				//++ #1600 смарт: Ермаков 26.01.2024 / Добавить доп текст в оповещения (продолжение задачи 1561)
				| Резервировать на складе: " + Строка(Заказ.Контрагент) + ". " + Текст + " _ " + Строка(Заказ) + Символы.ПС + " " + Символы.ПС + Символы.ПС + "Навигационная ссылка на документ: " + НавСсылка+Символы.ПС + "Ошибка: " + ОписаниеОшибки());
				//-- #1600 смарт: Ермаков 26.01.2024 / Добавить доп текст в оповещения (продолжение задачи 1561)
            КонецЕсли;
            ДанныеДляОтправки.Вставить("ТипТекста",ТипТекстаПочтовогоСообщения.ПростойТекст);
            ДанныеДляОтправки.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Высокая);
            РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись,ДанныеДляОтправки); 
            
        КонецПопытки;
	КонецЕсли;
	
	//++ #5004 смарт: Тимофеева 24.11.2025 / Проверить алгоритм автоматической установки резервов по приходу товаров. 
	Попытка
        Заказ.Разблокировать();
    Исключение			
    КонецПопытки;
	//-- #5004 смарт: Тимофеева 24.11.2025

КонецПроцедуры

//++ #Б3014 смарт: Шляпников 15.05.2025 / Интеграция с WMS. Атлант. Приемка. Разработка
Функция ПолучитьДополнительныеДанныеОбъекта(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартДополнительныеДанныеОбъектов.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.смартДополнительныеДанныеОбъектов КАК смартДополнительныеДанныеОбъектов
	|ГДЕ
	|	смартДополнительныеДанныеОбъектов.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Данные <> Неопределено Тогда
			Возврат Выборка.Данные.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//++ #Б3014 смарт: Шляпников 15.05.2025 / Интеграция с WMS. Атлант. Приемка. Разработка
Функция ЗаписатьДополнительныеДанныеОбъекта(Объект, Данные) Экспорт
	
	Набор = РегистрыСведений.смартДополнительныеДанныеОбъектов.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Объект, Истина);
	Набор.ОбменДанными.Загрузка = Истина;
	
	Запись = Набор.Добавить();
	Запись.Объект = Объект;
	Запись.Данные = Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
	
	Набор.Записать(Истина);
	
КонецФункции
	
#КонецОбласти

#Область Служебыне

//++ смарт:КМД #2_4 327 14.12.2020
//++ смарт:ММ #059 327 05.10.2020 - Перенос даты резерва, спр. Грузы 
Функция ПолучитьНомерВерсииПоследний(СсылкаНаОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Максимум(ВерсииОбъектов.НомерВерсии) КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.Объект = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВерсииОбъектов.Объект";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);

	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.НомерВерсии;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 05.10.2020

#КонецОбласти
